#### Terraform Plan 📖
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.worker_test.cloudflare_worker_script.this will be created
  + resource "cloudflare_worker_script" "this" {
      + account_id          = "805bb4fea4f198df0f788aaaad22a1be"
      + compatibility_flags = (known after apply)
      + content             = <<-EOT
            /**
             * Worker de prueba para validar el pipeline
             * Este worker responde con información básica
             */
            export default {
              async fetch(request, env, ctx) {
                const url = new URL(request.url);
                
                return new Response(JSON.stringify({
                  message: 'Worker de prueba - Infra Elite',
                  path: url.pathname,
                  method: request.method,
                  timestamp: new Date().toISOString(),
                  worker: 'test-worker'
                }), {
                  headers: {
                    'Content-Type': 'application/json',
                    'Access-Control-Allow-Origin': '*'
                  }
                });
              }
            }
        EOT
      + id                  = (known after apply)
      + name                = "test-worker"
      + tags                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.worker_test.cloudflare_worker_script.this,
  on modules/cloudflare_worker/main.tf line 1, in resource "cloudflare_worker_script" "this":
   1: resource "cloudflare_worker_script" "this" {

`cloudflare_worker_script` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_script` instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
_Pusheado por: @alexanderovie_